books={
    1:{"title":" Война и мир","autor":"Лев Толстой","year":"1869"},
    2:{"title":"Дом в котором","autor":"Мариам Петросян","year":"2009"},
    3:{"title":"Любовь-ненависть","autor":"Анна Джейн","year":"2018"},
    4:{"title":"Смерть в облаках","autor":"Агата Кристи","year":"1935"},
    5:{"title":"Парфюмер","autor":"Патрик Зюскинд","year":"1985"}
}#создаем словарь
for key,book in books.items():#перебераем элементы из словаря
    print(f"---------------------- Книга ",key,"-----------------------")#вывод на консоль 
    print (f"Название: {book["title"]}, Автор: {book["autor"]}")#вывод на консоль 
    print(f"----------------------{book["year"]}--------------------------")# вывод на консоль 
print()#переход на следующую строку
